Tekla Open API Reference for Tekla Structures 2025
RebarItem.Select Method
Overload List
Name | Description
Select(String, String)
 Selects the rebar item in the rebar database.
Select(String, Double, Boolean)
 Selects the rebar item in the rebar database.
Select(String, String, Double)
 Selects the rebar item in the rebar database.
Select(String, String, String)
 Selects the rebar item in the rebar database.
Select(String, Double, Double, Boolean)
 Selects the rebar item in the rebar database.
Select(String, Double, String, Boolean)
 Selects the rebar item in the rebar database.
Top
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace